# FilterValueRule Properties

---
The FilterValueRule type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule)
Top
#### Reference
FilterValueRule Class
Autodesk.Revit.DB Namespace